<?php

return [
    'navigation' => [
        'group' => 'النظام',
        'label' => 'متغيرات البيئة',
    ],

    'page' => [
        'title' => 'متغيرات البيئة (.env)',
    ],
    'tabs' => [
        'current-env' => [
            'title' => 'الملف الحالي',
        ],
        'backups' => [
            'title' => 'النسخ الاحتياطية',
        ],
    ],
    'actions' => [
        'add' => [
            'title' => 'إضافة متغير جديد',
            'modalHeading' => 'إضافة متغير جديد',
            'success' => [
                'title' => 'تم إضافة المفتاح ":Name" بنجاح',
            ],
            'form' => [
                'fields' => [
                    'key' => 'المفتاح',
                    'value' => 'القيمة',
                    'index' => 'إدراج بعد مفتاح موجود (اختياري)',
                ],
                'helpText' => [
                    'index' => 'في حالة رغبتك في وضع هذا الإدخال الجديد بعد إدخال موجود، يمكنك اختيار أحد المفاتيح الموجودة',
                ],
            ],
        ],
        'edit' => [
            'tooltip' => 'تعديل ":name"',
            'modal' => [
                'text' => 'تعديل المتغير',
            ],
        ],
        'delete' => [
            'tooltip' => 'حذف ":name"',
            'confirm' => [
                'title' => 'أنت على وشك حذف ":name" نهائياً. هل أنت متأكد من هذا الحذف؟',
            ],
        ],
        'clear-cache' => [
            'title' => 'مسح الكاش',
            'tooltip' => 'أحياناً يقوم Laravel بتخزين متغيرات البيئة مؤقتاً، لذا تحتاج إلى مسح جميع الكاش لإعادة قراءة تغييرات .env',
        ],

        'backup' => [
            'title' => 'إنشاء نسخة احتياطية',
            'success' => [
                'title' => 'تم إنشاء النسخة الاحتياطية بنجاح',
            ],
        ],
        'download' => [
            'title' => 'تحميل الملف الحالي',
            'tooltip' => 'تحميل ملف النسخة الاحتياطية ":name"',
        ],
        'upload-backup' => [
            'title' => 'رفع ملف نسخة احتياطية',
        ],
        'show-content' => [
            'modalHeading' => 'محتوى ":name"',
            'tooltip' => 'عرض المحتوى الخام',
        ],
        'restore-backup' => [
            'confirm' => [
                'title' => 'أنت على وشك استعادة ":name" ليحل محل ملف ".env" الحالي. يرجى تأكيد اختيارك',
            ],
            'modalSubmit' => 'استعادة',
            'tooltip' => 'استعادة ":name" كملف ENV الحالي',
        ],
        'delete-backup' => [
            'tooltip' => 'حذف ملف النسخة الاحتياطية ":name"',
            'confirm' => [
                'title' => 'أنت على وشك حذف ملف النسخة الاحتياطية ":name" نهائياً. هل أنت متأكد من هذا الحذف؟',
            ],
        ],
    ],
];
